INSERT INTO category ( name, img_url,placeholder)
VALUES ('디지털기기', '이미지url', '모델명, 구성품, 구매 시기, 사용감 (흠집, 파손 여부, 수리 여부), 전자파 인증번호 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('생활가전', '이미지url', '모델명, 구성품, 구매 시기, 사용감 (흠집, 파손 여부, 수리 여부), 전자파 인증번호 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('가구/인테리어', '이미지url', '모델명, 구매 시기, 크기 (가로/세로/높이), 사용감 (흠집, 파손 여부) 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('생활/주방', '이미지url', '구매 시기, 사용감 (흠집, 파손 여부) 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('유아동', '이미지url', '사이즈, 구매 시기, 사용감 (색바램, 얼룩, 뜯어짐) 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('유아도서', '이미지url', '권수 (전집의 경우 누락 여부), 사용감 (찢김, 색바램, 낙서) 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('여성의류', '이미지url', '구매 시기, 사이즈, 사용감 (색바램, 얼룩, 뜯어짐) 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('여성잡화', '이미지url', '구매 시기, 사이즈, 사용감 (색바램, 얼룩, 뜯어짐) 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('남성패션/잡화', '이미지url', '구매 시기, 사이즈, 사용감 (색바램, 얼룩, 뜯어짐) 등\n\n신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('뷰티/미용', '이미지url', '구매 시기, 제조일자 또는 유통기한, 사용감 (파손 여부) 등\n\n※ 화장품 샘플은 판매할 수 없어요.\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('스포츠/레저', '이미지url', '모델명, 구매 시기, 사용감 (흠집, 파손 여부) 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('취미/게임/음반', '이미지url', '구매 시기, 사용감 (흠집, 파손 여부, 상세 사진) 등\n\n ※ 게임, OTT 서비스 등의 계정 정보는 공유하거나 판매할 수 없어요.\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('중고차', '이미지url', '가격정보, 차 정보(연식, 등록일, 주행거리), 보험 이력 정보 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('티켓/교환권', '이미지url', '티켓 정보, 유효기간 등\n\n ※ 사용 안 한 교환권의 바코드가 게시되지 않도록 주의해 주세요. 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('가공식품', '이미지url', '구매 시기, 유통기한 등\n\n ※ 의약품, 건강기능식품은 관련법에 따라 판매할 수 없어요. 의약품, 건강기능식품 라벨이 제품에 표시되어 있는지 반드시 확인해주세요.\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('반려동물용품', '이미지url', '구매 시기, 사용감 (흠집, 파손 여부) 등\n\n ※ 생명이 있는 모든 동물, 곤충(무료분양, 열대어 포함)은 판매할 수 없어요.\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('식물', '이미지url', '품종, 크기, 키우는 방법 등\n\n ※ 생명이 있는 모든 동물, 곤충(무료분양, 열대어 포함)은 판매할 수 없어요.\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. '),
       ('기타 중고물품', '이미지url', '구매 시기, 사용감 (흠집, 파손 여부) 등\n\n 신뢰할 수 있는 거래를 위해 자세한 정보를 제공해주세요. 훈딩, 제이든, 에디, 하림, 감자, 코어와 함께 해요. ');


INSERT INTO town (town_id, city, county, district)
VALUES (1, '서울', '강남구', '역삼1동'),
       (2, '서울', '강남구', '역삼2동'),
       (3, '서울', '강남구', '세곡동'),
       (4, '서울', '강남구', '도곡1동'),
       (5, '서울', '강남구', '개포동'),
       (6, '서울', '강남구', '일원동'),
       (7, '서울', '강남구', '일원본동'),
       (8, '서울', '강남구', '대치2동'),
       (9, '서울', '강남구', '자곡동'),
       (10, '서울', '강남구', '삼성동'),
       (11, '서울', '강남구', '개포2동'),
       (12, '서울', '강남구', '율현동'),
       (13, '서울', '강남구', '대치동'),
       (14, '서울', '강남구', '대치1동'),
       (15, '서울', '강남구', '개포1동'),
       (16, '서울', '강남구', '신사동'),
       (17, '서울', '강남구', '대치4동'),
       (18, '서울', '강남구', '삼성2동'),
       (19, '서울', '강남구', '압구정동'),
       (20, '서울', '강남구', '논현1동'),
       (21, '서울', '강남구', '개포3동'),
       (22, '서울', '강남구', '개포4동'),
       (23, '서울', '강남구', '삼성1동'),
       (24, '서울', '강남구', '논현동'),
       (25, '서울', '강남구', '일원1동'),
       (26, '서울', '강남구', '청담동'),
       (27, '서울', '강남구', '역삼동'),
       (28, '서울', '강남구', '도곡동'),
       (29, '서울', '강남구', '논현2동'),
       (30, '서울', '강남구', '도곡2동'),
       (31, '서울', '강남구', '수서동');


insert into member(login_name, img_url, main_town_id, sub_town_id)
values ( 'gamja', 'img', 1, 2);


INSERT INTO product(title, content, price, thumbnail_url, town_id, category_id, member_id)
VALUES ('Example Product', 'This is an example product description.', 100, 'https://example.com/thumbnail.jpg', 1, 1, 1);
